# PyCitySchools

## Objective:
* Analyze the district-wide standardized test results:
    * Student's math and reading scores, as well as various information on the schools they attend.
* Help the school board and mayor make strategic decisions regarding future school budgets and priorities by aggregating the data and showcasing obvious trends in school performance

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

In [2]:
# File to Load (Remember to Change These)
school_csv = "Resources/schools_complete.csv"
student_csv = "Resources/students_complete.csv"

In [3]:
# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_csv)
student_data = pd.read_csv(student_csv)

In [4]:
# Preview DataFrames
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:
# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [7]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [8]:
# Validations of data types and missing values

In [9]:
school_data_complete.dtypes
# Numeric data is stored as int

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [10]:
school_data_complete.count()
# Dataset does not contain missing values

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [11]:
# Standardize variable names

In [12]:
school_data_df = school_data_complete.rename(columns={"Student ID": "student_id",
                                                    "student_name": "student_name",
                                                    "gender": "gender",
                                                    "grade" : "grade",
                                                    "school_name": "school_name",
                                                    "reading_score": "reading_score",
                                                    "math_score": "math_score",
                                                    "School ID": "school_id",
                                                    "type": "type",
                                                    "size": "size",
                                                    "budget": "budget"
                                                   })

school_data_df.head()

,student_id,student_name,gender,grade,school_name,reading_score,math_score,school_id,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [ ]:
# Explore data

In [13]:
school_data_df["type"].value_counts()
# There are two types of schools: District and Charter.
# There are more than twice as many District schools as Charter.

District    26976
Charter     12194
Name: type, dtype: int64

In [14]:
school_data_df["school_name"].value_counts()
# The school with most students is Bailey High School.

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: school_name, dtype: int64

In [15]:
school_data_df["gender"].value_counts()
# There are more Female students.

F    19735
M    19435
Name: gender, dtype: int64

In [16]:
school_data_df["grade"].value_counts()
# 9th grade has the most students cuantity.

9th     11408
10th    10168
11th     9695
12th     7899
Name: grade, dtype: int64

In [17]:
school_data_df.describe()

,student_id,reading_score,math_score,school_id,size,budget
count,39170.000000,39170.00000,39170.000000,39170.000000,39170.000000,3.917000e+04
mean,19584.500000,81.87784,78.985371,6.978172,3332.957110,2.117241e+06
std,11307.549359,10.23958,12.309968,4.444329,1323.914069,8.749987e+05
min,0.000000,63.00000,55.000000,0.000000,427.000000,2.480870e+05
25%,9792.250000,73.00000,69.000000,3.000000,1858.000000,1.081356e+06
50%,19584.500000,82.00000,79.000000,7.000000,2949.000000,1.910635e+06
75%,29376.750000,91.00000,89.000000,11.000000,4635.000000,3.022020e+06
max,39169.000000,99.00000,99.000000,14.000000,4976.000000,3.124928e+06

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Calculate the percentage of students who passed math **and** reading (% Overall Passing)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [18]:
# Calculate the total numbers of schools

total_schools = school_data_df["school_name"].unique()

len(total_schools)

15

In [22]:
# Calculate total students
# Used student_id instead of name because there are students with the same name in different schools. (i.e Michael Smith -26)

total_students = school_data_df["student_id"].unique()

len(total_students)

39170

In [28]:
# Calculate the total budget

total_budget = school_data["budget"].sum()

total_budget

24649428

In [30]:
# Calculate everage math grades
math_mean_score = school_data_df["math_score"].mean()

math_mean_score

78.98537145774827

In [31]:
# Calculate average reading grades
reading_mean_score = school_data_df["reading_score"].mean()

reading_mean_score

81.87784018381414

In [ ]:
# Calculate the percentage of students with a passing math score (70 or greater)

In [ ]:
# Calculate the percentage of students with a passing reading score (70 or greater)

In [ ]:
# Calculate the percentage of students who passed math and reading (% Overall Passing)

In [ ]:
# Create a dataframe to hold the above results
# Optional: give the displayed data cleaner formatting

district_summary_df = pd.DataFrame({"Total Schools": [total_schools],
                                   "Total Students": [total_students],
                                    "Total Budget": [total_budget],
                                    "Average Math Score": [math_mean_score],
                                    "Average Reading Score": [reading_mean_score],
                                    "% Passing Math": [],
                                    "% Passing Reading": [],
                                    "% Overall Passing": []
                                   })

district_summary_df

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * % Overall Passing (The percentage of students that passed math **and** reading.)
  
* Create a dataframe to hold the above results

## Top Performing Schools (By % Overall Passing)

* Sort and display the top five performing schools by % overall passing.

## Bottom Performing Schools (By % Overall Passing)

* Sort and display the five worst-performing schools by % overall passing.

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

## Reading Score by Grade

* Perform the same operations as above for reading scores

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

## Scores by School Size

* Perform the same operations as above, based on school size.

## Scores by School Type

* Perform the same operations as above, based on school type